#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/stum0/nostr_mempool_bot/runs/run-Ze632i1CsbFtqKHm

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
random_string.suffix: Refreshing state... [id=huBus05i]
module.eks.module.fargate_profile["nostr_project"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.fargate_profile["nostr_project"].data.aws_caller_identity.current: Reading...
data.aws_availability_zones.available: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0bb8060d3b0476237]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0bbadbdfcf236736f]
module.eks.data.aws_default_tags.current: Reading...
module.eks.module.fargate_profile["nostr_project"].data.aws_partition.current: Reading...
module.eks.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/nostr-test-huBus05i/cluster]
module.eks.data.aws_default_tags.current: Read complete after 1s [id=aws]
module.eks.module.fargate_profile["nostr_project"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 1s [id=3567408449]
module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 1s [id=2053943846]
module.eks.module.fargate_profile["nostr_project"].data.aws_partition.current: Read complete after 1s [id=aws]
module.eks.module.kms.data.aws_partition.current: Reading...
module.eks.module.kms.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current: Reading...
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.eks.module.kms.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=arn:aws:iam::493031039834:policy/vpc-flow-log-to-cloudwatch-20221107132751995600000001]
module.eks.module.fargate_profile["example"].aws_iam_role.this[0]: Refreshing state... [id=nostr-project-20221107150322734700000001]
module.eks.module.fargate_profile["nostr_project"].data.aws_caller_identity.current: Read complete after 1s [id=493031039834]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221107132751996300000002]
module.eks.data.aws_caller_identity.current: Read complete after 1s [id=493031039834]
module.eks.module.kms.data.aws_caller_identity.current: Read complete after 0s [id=493031039834]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=nostr-test-huBus05i-cluster-20221107132751998400000003]
data.aws_availability_zones.available: Read complete after 1s [id=eu-west-2]
module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"]: Refreshing state... [id=nostr-project-20221107150322734700000001-20221107150323360800000004]
module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=nostr-project-20221107150322734700000001-20221107150323324700000003]
module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0]: Refreshing state... [id=vpc-flow-log-role-20221107132751996300000002-20221107132752564200000004]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"]: Refreshing state... [id=nostr-test-huBus05i-cluster-20221107132751998400000003-20221107132752643200000006]
module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"]: Refreshing state... [id=nostr-test-huBus05i-cluster-20221107132751998400000003-20221107132752638100000005]
module.vpc.aws_cloudwatch_log_group.flow_log[0]: Refreshing state... [id=/aws/vpc-flow-log/vpc-0bb8060d3b0476237]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0da6dda190e9483c7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-066eb83cdb142abbf]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0b9bde3d1237d5c99]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0340c2c5c5e35dc9c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-00ffe34fc3f07df1d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-03c0896e4f63e5333]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0baa00a44be58959b]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0364f94f1c3626a34]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0bd0cc91989428ad1]
module.vpc.aws_flow_log.this[0]: Refreshing state... [id=fl-01c6595f15e65b0a3]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0da6dda190e9483c71080289494]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e9d6c627f28aa857]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08bce5be62271bc1f]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-01c74887231129f49]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0c4d8f418d78c9908]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=nostr-test-huBus05i]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b57558e098b4fc7a]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f9c10d9421431d37]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0d28a8a8f067a92c9]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-03c0896e4f63e53331080289494]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.fargate_profile["example"].aws_eks_fargate_profile.this[0]: Refreshing state... [id=nostr-test-huBus05i:nostr-project]
helm_release.argocd: Refreshing state... [id=argocd]
module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=0fec62e3a5b6c39cf9c786f5984abfdb03f2915d]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::493031039834:oidc-provider/oidc.eks.eu-west-2.amazonaws.com/id/0D642E4C545E7E5D077021B0098638F0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # helm_release.argocd is tainted, so must be replaced
-/+ resource "helm_release" "argocd" {
      ~ id                         = "argocd" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version = "v2.5.1"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - server = {
                          - additionalApplications = [
                              - {
                                  - destination = {
                                      - server = "https://kubernetes.default.svc"
                                    }
                                  - name        = "cluster-config"
                                  - namespace   = "argocd"
                                  - project     = "default"
                                  - source      = {
                                      - directory      = {
                                          - recurse = true
                                        }
                                      - path           = "argocd/manifests/cluster"
                                      - repoURL        = "https://github.com/stum0/terraform_config_files/tree/main/argocd/manifests/cluster"
                                      - targetRevision = "HEAD"
                                    }
                                  - syncPolicy  = {
                                      - automated = {
                                          - prune    = false
                                          - selfHeal = false
                                        }
                                    }
                                },
                            ]
                        }
                    }
                )
              - version     = "5.13.4"
            },
        ] -> (known after apply)
        name                       = "argocd"
      ~ status                     = "failed" -> "deployed"
        # (26 unchanged attributes hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "coredns"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "nostr-test-huBus05i"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name    = "kube-proxy"
      + addon_version = (known after apply)
      + arn           = (known after apply)
      + cluster_name  = "nostr-test-huBus05i"
      + created_at    = (known after apply)
      + id            = (known after apply)
      + modified_at   = (known after apply)
      + tags_all      = (known after apply)
    }

  # module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name        = "vpc-cni"
      + addon_version     = (known after apply)
      + arn               = (known after apply)
      + cluster_name      = "nostr-test-huBus05i"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + modified_at       = (known after apply)
      + resolve_conflicts = "OVERWRITE"
      + tags_all          = (known after apply)
    }

  # module.eks.module.fargate_profile["example"].aws_eks_fargate_profile.this[0] will be destroyed
  # (because module.eks.module.fargate_profile["example"] is not in configuration)
  - resource "aws_eks_fargate_profile" "this" {
      - arn                    = "arn:aws:eks:eu-west-2:493031039834:fargateprofile/nostr-test-huBus05i/nostr-project/aac2294f-da89-860e-f26f-f86358febcd7" -> null
      - cluster_name           = "nostr-test-huBus05i" -> null
      - fargate_profile_name   = "nostr-project" -> null
      - id                     = "nostr-test-huBus05i:nostr-project" -> null
      - pod_execution_role_arn = "arn:aws:iam::493031039834:role/nostr-project-20221107150322734700000001" -> null
      - status                 = "ACTIVE" -> null
      - subnet_ids             = [
          - "subnet-0340c2c5c5e35dc9c",
          - "subnet-066eb83cdb142abbf",
          - "subnet-0b9bde3d1237d5c99",
        ] -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null

      - selector {
          - labels    = {
              - "Application" = "nostr-bot"
            } -> null
          - namespace = "nostr-bot" -> null
        }

      - timeouts {
          - create = "20m" -> null
          - delete = "20m" -> null
        }
    }

  # module.eks.module.fargate_profile["example"].aws_iam_role.this[0] will be destroyed
  # (because module.eks.module.fargate_profile["example"] is not in configuration)
  - resource "aws_iam_role" "this" {
      - arn                   = "arn:aws:iam::493031039834:role/nostr-project-20221107150322734700000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks-fargate-pods.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-11-07T15:03:22Z" -> null
      - description           = "Fargate profile IAM role" -> null
      - force_detach_policies = true -> null
      - id                    = "nostr-project-20221107150322734700000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "nostr-project-20221107150322734700000001" -> null
      - name_prefix           = "nostr-project-" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAXFSXQUNNLK2SXYYH3" -> null

      - inline_policy {}
    }

  # module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be destroyed
  # (because module.eks.module.fargate_profile["example"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "nostr-project-20221107150322734700000001-20221107150323360800000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy" -> null
      - role       = "nostr-project-20221107150322734700000001" -> null
    }

  # module.eks.module.fargate_profile["example"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be destroyed
  # (because module.eks.module.fargate_profile["example"] is not in configuration)
  - resource "aws_iam_role_policy_attachment" "this" {
      - id         = "nostr-project-20221107150322734700000001-20221107150323324700000003" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "nostr-project-20221107150322734700000001" -> null
    }

  # module.eks.module.fargate_profile["nostr_project"].aws_eks_fargate_profile.this[0] will be created
  + resource "aws_eks_fargate_profile" "this" {
      + arn                    = (known after apply)
      + cluster_name           = "nostr-test-huBus05i"
      + fargate_profile_name   = "nostr-project"
      + id                     = (known after apply)
      + pod_execution_role_arn = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0340c2c5c5e35dc9c",
          + "subnet-066eb83cdb142abbf",
          + "subnet-0b9bde3d1237d5c99",
        ]
      + tags_all               = (known after apply)

      + selector {
          + labels    = {
              + "Application" = "nostr-bot"
            }
          + namespace = "nostr-bot"
        }

      + timeouts {}
    }

  # module.eks.module.fargate_profile["nostr_project"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks-fargate-pods.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Fargate profile IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "nostr-project-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.fargate_profile["nostr_project"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.fargate_profile["nostr_project"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

Plan: 8 to add, 0 to change, 5 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Ze632i1CsbFtqKHm/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file
│ "/home/tfc-agent/.tfc-agent/component/terraform/runs/run-Ze632i1CsbFtqKHm/terraform.tfvars".
│ If you meant to use this value, add a "variable" block to the
│ configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```

</details>

*Pushed by: @stum0, Action: `pull_request`*